{
  "url": "https://api.github.com/repos/shap/shap/issues/2503",
  "repository_url": "https://api.github.com/repos/shap/shap",
  "labels_url": "https://api.github.com/repos/shap/shap/issues/2503/labels{/name}",
  "comments_url": "https://api.github.com/repos/shap/shap/issues/2503/comments",
  "events_url": "https://api.github.com/repos/shap/shap/issues/2503/events",
  "html_url": "https://github.com/shap/shap/issues/2503",
  "id": 1207411136,
  "node_id": "I_kwDOBHDcK85H96HA",
  "number": 2503,
  "title": "Remove variables from explanation",
  "user": {
    "login": "tweber36",
    "id": 1706073,
    "node_id": "MDQ6VXNlcjE3MDYwNzM=",
    "avatar_url": "https://avatars.githubusercontent.com/u/1706073?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/tweber36",
    "html_url": "https://github.com/tweber36",
    "followers_url": "https://api.github.com/users/tweber36/followers",
    "following_url": "https://api.github.com/users/tweber36/following{/other_user}",
    "gists_url": "https://api.github.com/users/tweber36/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/tweber36/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/tweber36/subscriptions",
    "organizations_url": "https://api.github.com/users/tweber36/orgs",
    "repos_url": "https://api.github.com/users/tweber36/repos",
    "events_url": "https://api.github.com/users/tweber36/events{/privacy}",
    "received_events_url": "https://api.github.com/users/tweber36/received_events",
    "type": "User",
    "site_admin": false
  },
  "labels": [

  ],
  "state": "open",
  "locked": false,
  "assignee": null,
  "assignees": [

  ],
  "milestone": null,
  "comments": 0,
  "created_at": "2022-04-18T20:15:45Z",
  "updated_at": "2022-04-18T20:15:45Z",
  "closed_at": null,
  "author_association": "NONE",
  "active_lock_reason": null,
  "body": "Hi, \r\n\r\nI have a CatBoostRegressor model for which i'd like to explain some predictions (using a TreeExplainer). But i would like to \"remove\" the contributions of some variables because i do not want them to be part of the explain. \r\n\r\nTo be more precise, i'm trying to predict real estate prices using properties characteristics along with geospatial data (latitude/longitude), and when i'm explaining a prediction i want to explain predictions relatively to those coordinates and not the marginal contribution over the whole dataset. It's like saying \"for this particular spot, having a swimming pool will have a marginal effect of +X\" and not \"for this property, the swimming pool has a marginal effect of +X, and the position a marginal effect of +/- Y\"\r\n\r\nTo make things more simple, let's say i only have two variables X1 and X2, X2 being the coordinates i do not want in my explanation. And i'm trying to explain x=(x1, x2)\r\n\r\nMy first instinct was to add x2 shap value to the base value to get a \"new\" base value and set the x2 shap value to 0. The thing is my shap value for x1 is calculated over the whole distribution which can be very different than when X2=x2. For example if my prediction around X2=x2 depends only on X2, then the shap value for x1 should be 0. \r\n\r\nThen i thought about giving a new reference dataset (using the \"interventional\" mode) either by setting X2=x2 for all my training samples or by selecting the closest samples around x2. This gives interesting results but it has 2 issues: first it is very slow compared to the \"tree_path_dependent\" option (even when limiting to 100 or 200 samples), and also it uses unrealistic samples to calculate the shap values (considering variables are independant).\r\n\r\nI think my best bet would be to \"tweak\" the tree_path_dependent approach so to keep the conditional expectation and to run fast, but still find a way to ensure X2 is set to x2. I was thinking i could restrict the number of possible subsets that goes down the Tree SHAP algorithm (by removing those where X2 is not set. For instance, in this example, we have 4 subsets (null, {X1}, {X2}, {X1, X2}), then i would to the calculation only on {X2} and {X1, X2} (the weights might need to be re-adjusted). \r\n\r\nDo you think it can be a good way to achieve what i'm trying to do ? \r\nIf so, could it interest other people and maybe add it as an new option to the TreeExplainer ? \r\nOr if not, do you have any idea how i could manage to \"freeze\" some variables in my explanations ? \r\n\r\nThanks, \r\nThomas",
  "closed_by": null,
  "reactions": {
    "url": "https://api.github.com/repos/shap/shap/issues/2503/reactions",
    "total_count": 0,
    "+1": 0,
    "-1": 0,
    "laugh": 0,
    "hooray": 0,
    "confused": 0,
    "heart": 0,
    "rocket": 0,
    "eyes": 0
  },
  "timeline_url": "https://api.github.com/repos/shap/shap/issues/2503/timeline",
  "performed_via_github_app": null,
  "state_reason": null
}
